#read_verilog FIFO.v

hierarchy -check -top FIFO_cond
proc; opt; fsm; opt; memory; opt
techmap; opt

dfflibmap -liberty ./lib/cmos_cells.lib
abc -liberty ./lib/cmos_cells.lib

clean

write_verilog FIFO_synth1.v