#read_verilog phy_rx.v

hierarchy -check -top phy_rx_cond
proc; opt; fsm; opt; memory; opt
techmap; opt

dfflibmap -liberty ./lib/cmos_cells.lib
abc -liberty ./lib/cmos_cells.lib

clean

write_verilog phy_rx_synth1.v

